app/controllers/photos_controller.rb

INSERT INTO `photos` (`description`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('hi', '2011-06-24 09:39:35', '2011-06-24 09:39:35', 'ff061e5557102b3cf57dcfa623b56e39.jpg', 'image/jpeg', 9011, '2011-06-24 09:39:35')
---
  def create
    @photo = Photo.new(params[:photo])
    @photo.image = File.new(upload_path)
    @photo.save

SELECT `photos`.* FROM `photos` WHERE (`photos`.`id` = 1) LIMIT 1
---
  def show
    @photo = Photo.find(params[:id])

SELECT `photos`.* FROM `photos`
---
  def index
    @photos = Photo.all